_org_posts/_posts/2022-01-17-boj-3079.org
#+HTML: ---
#+HTML: title: BOJ 3079 입국심사
#+HTML: tags: 이분탐색
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 3079 입국심사
- 심사대가 N개, 사람수가 M
- 심사대는 심사시간이 각기다름
- 빈 곳에 아무 순서대로 가서 심사를 받으면 됨
- 최소 시간은 얼마?

** 접근하기
#+BEGIN_EXAMPLE
a심사대가 7시간이 소모되고, b심사대가 10시간이 소모되면

시간이 28이면

28/7 = 4
28/10 = 2

M = 4 + 2 가 된다. ->최적 값

시간이 60이면

60/7 = 8
60/10 = 6

8 + 6 > M

총 시간을 X로 놓고, min=0 ~ max=M * 가장오래걸리는 심사대의 시간
이분탐색을 한다.
 
#+END_EXAMPLE


** 코드 2
- https://www.acmicpc.net/blog/view/109 보고 바꿈
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;

typedef long long ll;

ll N, M;
int a[100010];

bool check(ll num)
{
    ll cnt = 0;
    for(int i=0;i<N;i++) {
        cnt += num/a[i];
    }

    return (cnt >= M);
}

int main(int argc, char* argv[])
{
    scanf("%lld %lld", &N, &M);

    for(int i=0;i<N;i++) {
        scanf("%d",&a[i]);
    }    
    sort(a, a+N);
    ll s = 0;
    ll e = a[N-1] * M;
    ll ans = e;
    while(s + 1 < e) {
        ll mid = (s+e)/2;

        if (check(mid)) {
            ans = min(ans, mid);
            e = mid;
        } else {
            s = mid;
        }
    }
    printf("%lld\n", ans);
}
#+END_SRC
** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;
typedef long long ll;
int N, M;
ll a[100010];

inline bool check(ll mid)
{
    ll sum = 0;
    for(register int i=0;i<N;i++) {
        sum += mid/a[i]; 
    }

    return (sum >= M);
}

int main(int argc, char* argv[])
{
    //freopen("input.txt", "r", stdin);
    freopen("input2.txt", "r", stdin);
    scanf("%d %d", &N, &M);
    for(register int i=0;i<N;i++) {
        scanf("%lld", &a[i]);
    }  
    sort(a, a+N);

    register ll s = 0;
    register ll e = a[N-1];
    e = e * M; 
    
    register ll ans = e;
    while(s<=e) {
        ll mid = (s+e)/2;
        if (check(mid)) {
            ans = min(ans, mid);
            e = mid - 1;
        } else {
            s = mid + 1;
        }
    }    
    printf("%lld\n", ans);
    return 0;
}
#+END_SRC


** 문제 링크
- https://www.acmicpc.net/problem/3079
