_posts/2022-01-17-boj-3079.html
---
title: BOJ 3079 입국심사
tags: 이분탐색
toc: true
toc_sticky: true
---

<div id="outline-container-org920043c" class="outline-2">
<h2 id="org920043c">BOJ 3079 입국심사</h2>
<div class="outline-text-2" id="text-org920043c">
<ul class="org-ul">
<li>심사대가 N개, 사람수가 M</li>
<li>심사대는 심사시간이 각기다름</li>
<li>빈 곳에 아무 순서대로 가서 심사를 받으면 됨</li>
<li>최소 시간은 얼마?</li>
</ul>
</div>
</div>

<div id="outline-container-orgb73c9cf" class="outline-2">
<h2 id="orgb73c9cf">접근하기</h2>
<div class="outline-text-2" id="text-orgb73c9cf">
<pre class="example">
a심사대가 7시간이 소모되고, b심사대가 10시간이 소모되면

시간이 28이면

28/7 = 4
28/10 = 2

M = 4 + 2 가 된다. -&gt;최적 값

시간이 60이면

60/7 = 8
60/10 = 6

8 + 6 &gt; M

총 시간을 X로 놓고, min=0 ~ max=M * 가장오래걸리는 심사대의 시간
이분탐색을 한다.
 
</pre>
</div>
</div>


<div id="outline-container-orgebe95ae" class="outline-2">
<h2 id="orgebe95ae">코드 2</h2>
<div class="outline-text-2" id="text-orgebe95ae">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/blog/view/109">https://www.acmicpc.net/blog/view/109</a> 보고 바꿈</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[100010];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">check</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">cnt</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        cnt += num/a[i];
    }

    <span style="color: #729fcf; font-weight: bold;">return</span> (cnt &gt;= M);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%lld %lld"</span>, &amp;N, &amp;M);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>,&amp;a[i]);
    }    
    sort(a, a+N);
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">s</span> = 0;
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">e</span> = a[N-1] * M;
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ans</span> = e;
    <span style="color: #729fcf; font-weight: bold;">while</span>(s + 1 &lt; e) {
        <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">mid</span> = (s+e)/2;

        <span style="color: #729fcf; font-weight: bold;">if</span> (check(mid)) {
            ans = min(ans, mid);
            e = mid;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            s = mid;
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ans);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5591812" class="outline-2">
<h2 id="org5591812">코드</h2>
<div class="outline-text-2" id="text-org5591812">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">a</span>[100010];

<span style="color: #729fcf; font-weight: bold;">inline</span> <span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">check</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">mid</span>)
{
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">sum</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">register</span> <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        sum += mid/a[i]; 
    }

    <span style="color: #729fcf; font-weight: bold;">return</span> (sum &gt;= M);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #888a85;">//</span><span style="color: #888a85;">freopen("input.txt", "r", stdin);</span>
    freopen(<span style="color: #ad7fa8; font-style: italic;">"input2.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;M);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">register</span> <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%lld"</span>, &amp;a[i]);
    }  
    sort(a, a+N);

    <span style="color: #729fcf; font-weight: bold;">register</span> <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">s</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">register</span> <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">e</span> = a[N-1];
    e = e * M; 

    <span style="color: #729fcf; font-weight: bold;">register</span> <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ans</span> = e;
    <span style="color: #729fcf; font-weight: bold;">while</span>(s&lt;=e) {
        <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">mid</span> = (s+e)/2;
        <span style="color: #729fcf; font-weight: bold;">if</span> (check(mid)) {
            ans = min(ans, mid);
            e = mid - 1;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            s = mid + 1;
        }
    }    
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc5d18d2" class="outline-2">
<h2 id="orgc5d18d2">문제 링크</h2>
<div class="outline-text-2" id="text-orgc5d18d2">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/3079">https://www.acmicpc.net/problem/3079</a></li>
</ul>
</div>
</div>
